Repository: mozilla-l10n/mt-training-data
Catalog: mt/mt_pontoon.tmx
Source language: en_us
Languages: mt

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
mt: Se tibda' tniżżel <size>{ $size }GB</size>, trid tkompli?

source: You are prepared to initiate a download of <b>{ $size }</b>
mt: Tinsab lest biex tniżżel ġabra ta' daqs <b>{ $size }</b>

source: You can choose to make your username public or anonymous.
mt: Tista' tagħżel jekk il-username tiegħek ikunx pubbliku jew tibqax anonimu.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
mt: Tista' tgħinna nibnu ġabra ta' data ddiversifikata u open source, billi toħloq profil fuq Common Voice u tikkontribwixxi l-vuċi tiegħek.

source: You must allow microphone access.
mt: Trid tippermetti aċċess għall-mikrofonu.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
mt: Ir-recordings anonimi tiegħek jinżammu fil-ġabra Common Voice. Ladarba tħassar il-profil ma tkunx tista' titlob li jitneħħew ir-recordings mill-ġabra.

source: Your avatar now includes a voice clip!
mt: L-avatar tiegħek issa għandu klip bil-vuċi!

source: Your daily goal has been created
mt: L-għan tiegħek għal-llum ilħaqtu

source: Your download has started.
mt: Bdejt tniżżel.

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
mt: Bis-settings kif qiegħdin, <bold>MHUX</bold> se tkun qed tirċievi l-emails biex ifakkruk fl-għanijiet, ituk aġġornamenti dwar il-progress u jibgħatulek in-newsletters dwar Common Voice

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
mt: Bis-settings kif qiegħdin, se tkun qed tirċievi l-emails biex ifakkruk fl-għanijiet, ituk aġġornamenti dwar il-progress u tirċievi n-newsletters dwar Common Voice

source: Your Languages
mt: Il-Lingwi Tiegħek

source: Your username and email will not be associated with the published data.
mt: Il-username u l-email tiegħek ma jiġux assoċjati mad-data li tiġi ppubblikata.

source: Your weekly goal has been created
mt: l-għan tiegħek għal dil-ġimgħa lħaqtu

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mt: Għadek kemm għint lil Common Voice jilħaq <goalPercentage></goalPercentage> tal-{ $goalValue } ta' recordings li nippruvaw nilħqu kuljum!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mt: Għadek kemm għint lil Common Voice jilħaq <goalPercentage></goalPercentage> tal-{ $goalValue } ta' validazzjonijiet li nippruvaw nilħqu kuljum!

source: You've successfully signed up for contributing to { $language }. Thank you.
mt: Irnexxilek issir kontributur għall-{ $language }. Grazzi!
